package mercari.pc.exhibit;

import static common.constant.MercariConstants.*;

import mercari.pc.Pc_Mercari;

/**
 * =====================================================================================================================
 * PC版メルカリ出品処理
 * =====================================================================================================================
 *
 * @author kimC
 *
 */
public class Pc_Exhibit extends Pc_Mercari {
	/** 「再スタートフラグ」 */
	Boolean restart_flag = Boolean.FALSE;

	/**
	 * コンストラクタ
	 */
	public Pc_Exhibit() {
		// PC版出品画面
		driver.get(PC_EXHIBIT_URL);
	}

	/**
	 * =================================================================================================================
	 * 出品処理
	 * =================================================================================================================
	 *
	 * @return Boolean 出品結果
	 *
	 * @author kimC
	 *
	 */
	public Boolean execute() {
		try {
			driver.quit();
			return Boolean.TRUE;
		} catch (Exception e) {
			driver.quit();
			System.out.println("【エラー】：出品が失敗しました。");
			return Boolean.FALSE;
		}
	}

	/**
	 * =================================================================================================================
	 * 出品開始
	 * =================================================================================================================
	 *
	 * @author kimC
	 *
	 */
	public void start() {
		try {
			// TODO 出品処理
		} catch (Exception e) {
			System.out.println("【エラー】：○○商品の出品が失敗！");
			restart();
		}
	}

	/**
	 * =================================================================================================================
	 * 再出品
	 * =================================================================================================================
	 *
	 * @author kimC
	 *
	 */
	public void restart() {
		try {
			// TODO 再出品
		} catch (Exception e) {
			System.out.println("【エラー】：○○商品の再出品が失敗！");
		}
	}

}
