package common.constant;

/**
 * =====================================================================================================================
 * 【メルカリ】定数
 * =====================================================================================================================
 *
 * @author kimC
 *
 */
public class MercariConstants {

	/**
	 * privateコンストラクタでインスタンス生成を抑止
	 */
	private MercariConstants() {
	}

	// ==================================================================================================================
	// 【URL】
	// ==================================================================================================================
	/** PC版メルカリログインURL */
	public static final String PC_LOGIN_URL = "https://www.mercari.com/jp/login/?login_callback=https%3A%2F%2Fwww.mercari.com%2Fjp%2F";
	/** PC版メルカリログインURL */
	public static final String PC_EXHIBIT_URL = "https://www.mercari.com/jp/sell/";

	// ==================================================================================================================
	// 【文字列】
	// ==================================================================================================================

	// ==================================================================================================================
	// 【整数】
	// ==================================================================================================================
	/** 「0」 */
	public static final int INT_0 = 0;
	/** 「1」 */
	public static final int INT_1 = 1;
	/** 「2」 */
	public static final int INT_2 = 2;
	/** 「3」 */
	public static final int INT_3 = 3;
	/** 「4」 */
	public static final int INT_4 = 4;
	/** 「5」 */
	public static final int INT_5 = 5;
	/** 「6」 */
	public static final int INT_6 = 6;
	/** 「7」 */
	public static final int INT_7 = 7;
	/** 「8」 */
	public static final int INT_8 = 8;
	/** 「9」 */
	public static final int INT_9 = 9;
}
